import {
  CodeXml,
  Github,
  HeartHandshake,
  Laptop,
  Lightbulb,
  Mail,
  MousePointerClick,
  ShieldCheck,
  Zap,
} from "lucide-react";
import "../styles/about.css";
import { hoverEffect } from "../motion/motionVariants";
import { motion } from "framer-motion";

const technologies = [
  {
    label: "React js",
    description: "Frontend",
    icon: (
      <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
        <path d="M14.23 12.004a2.236 2.236 0 0 1-2.235 2.236 2.236 2.236 0 0 1-2.236-2.236 2.236 2.236 0 0 1 2.235-2.236 2.236 2.236 0 0 1 2.236 2.236zm2.648-10.69c-1.346 0-3.107.96-4.888 2.622-1.78-1.653-3.542-2.602-4.887-2.602-.41 0-.783.093-1.106.278-1.375.793-1.683 3.264-.973 6.365C1.98 8.917 0 10.42 0 12.004c0 1.59 1.99 3.097 5.043 4.03-.704 3.113-.39 5.588.988 6.38.32.187.69.275 1.102.275 1.345 0 3.107-.96 4.888-2.624 1.78 1.654 3.542 2.603 4.887 2.603.41 0 .783-.09 1.106-.275 1.374-.792 1.683-3.263.973-6.365C22.02 15.096 24 13.59 24 12.004c0-1.59-1.99-3.097-5.043-4.032.704-3.11.39-5.587-.988-6.38-.318-.184-.688-.277-1.092-.278zm-.005 1.09v.006c.225 0 .406.044.558.127.666.382.955 1.835.73 3.704-.054.46-.142.945-.25 1.44-.96-.236-2.006-.417-3.107-.534-.66-.905-1.345-1.727-2.035-2.447 1.592-1.48 3.087-2.292 4.105-2.295zm-9.77.02c1.012 0 2.514.808 4.11 2.28-.686.72-1.37 1.537-2.02 2.442-1.107.117-2.154.298-3.113.538-.112-.49-.195-.964-.254-1.42-.23-1.868.054-3.32.714-3.707.19-.09.4-.127.563-.132zm4.882 3.05c.455.468.91.992 1.36 1.564-.44-.02-.89-.034-1.345-.034-.46 0-.915.01-1.36.034.44-.572.895-1.096 1.345-1.565zM12 8.1c.74 0 1.477.034 2.202.093.406.582.802 1.203 1.183 1.86.372.64.71 1.29 1.018 1.946-.308.655-.646 1.31-1.013 1.95-.38.66-.773 1.288-1.18 1.87-.728.063-1.466.098-2.21.098-.74 0-1.477-.035-2.202-.093-.406-.582-.802-1.204-1.183-1.86-.372-.64-.71-1.29-1.018-1.946.303-.657.646-1.313 1.013-1.954.38-.66.773-1.286 1.18-1.868.728-.064 1.466-.098 2.21-.098zm-3.635.254c-.24.377-.48.763-.704 1.16-.225.39-.435.782-.635 1.174-.265-.656-.49-1.31-.676-1.947.64-.15 1.315-.283 2.015-.386zm7.26 0c.695.103 1.365.23 2.006.387-.18.632-.405 1.282-.66 1.933-.2-.39-.41-.783-.64-1.174-.225-.392-.465-.774-.705-1.146zm3.063.675c.484.15.944.317 1.375.498 1.732.74 2.852 1.708 2.852 2.476-.005.768-1.125 1.74-2.857 2.475-.42.18-.88.342-1.355.493-.28-.958-.646-1.956-1.1-2.98.45-1.017.81-2.01 1.085-2.964zm-13.395.004c.278.96.645 1.957 1.1 2.98-.45 1.017-.812 2.01-1.086 2.964-.484-.15-.944-.318-1.37-.5-1.732-.737-2.852-1.706-2.852-2.474 0-.768 1.12-1.742 2.852-2.476.42-.18.88-.342 1.356-.494zm11.678 4.28c.265.657.49 1.312.676 1.948-.64.157-1.316.29-2.016.39.24-.375.48-.762.705-1.158.225-.39.435-.788.636-1.18zm-9.945.02c.2.392.41.783.64 1.175.23.39.465.772.705 1.143-.695-.102-1.365-.23-2.006-.386.18-.63.406-1.282.66-1.933zM17.92 16.32c.112.493.2.968.254 1.423.23 1.868-.054 3.32-.714 3.708-.147.09-.338.128-.563.128-1.012 0-2.514-.807-4.11-2.28.686-.72 1.37-1.536 2.02-2.44 1.107-.118 2.154-.3 3.113-.54zm-11.83.01c.96.234 2.006.415 3.107.532.66.905 1.345 1.727 2.035 2.446-1.595 1.483-3.092 2.295-4.11 2.295-.22-.005-.406-.05-.553-.132-.666-.38-.955-1.834-.73-3.703.054-.46.142-.944.25-1.438zm4.56.64c.44.02.89.034 1.345.034.46 0 .915-.01 1.36-.034-.44.572-.895 1.095-1.345 1.565-.455-.47-.91-.993-1.36-1.565z" />
      </svg>
    ),
  },
  {
    label: "Motion",
    description: "Animations",
    icon: (
      <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
        <path d="M4 0h16v8h-8zM4 8h8l8 8H4zM4 16h8v8z" />
      </svg>
    ),
  },
  {
    label: "Hono",
    description: "Backend",
    icon: (
      <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
        <path d="M12.445.002a45.529 45.529 0 0 0-5.252 8.146 8.595 8.595 0 0 1-.555-.53 27.796 27.796 0 0 0-1.205-1.542 8.762 8.762 0 0 0-1.251 2.12 20.743 20.743 0 0 0-1.448 5.88 8.867 8.867 0 0 0 .338 3.468c1.312 3.48 3.794 5.593 7.445 6.337 3.055.438 5.755-.333 8.097-2.312 2.677-2.59 3.359-5.634 2.047-9.132a33.287 33.287 0 0 0-2.988-5.59A91.34 91.34 0 0 0 12.615.053a.216.216 0 0 0-.17-.051Zm-.336 3.906a50.93 50.93 0 0 1 4.794 6.552c.448.767.817 1.57 1.108 2.41.606 2.386-.044 4.354-1.951 5.904-1.845 1.298-3.87 1.683-6.072 1.156-2.376-.737-3.75-2.335-4.121-4.794a5.107 5.107 0 0 1 .242-2.266c.358-.908.79-1.774 1.3-2.601l1.446-2.121a397.33 397.33 0 0 0 3.254-4.24Z" />
      </svg>
    ),
  },
  {
    label: "MongoDB",
    description: "Database",
    icon: (
      <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
        <path d="M17.193 9.555c-1.264-5.58-4.252-7.414-4.573-8.115-.28-.394-.53-.954-.735-1.44-.036.495-.055.685-.523 1.184-.723.566-4.438 3.682-4.74 10.02-.282 5.912 4.27 9.435 4.888 9.884l.07.05A73.49 73.49 0 0111.91 24h.481c.114-1.032.284-2.056.51-3.07.417-.296.604-.463.85-.693a11.342 11.342 0 003.639-8.464c.01-.814-.103-1.662-.197-2.218zm-5.336 8.195s0-8.291.275-8.29c.213 0 .49 10.695.49 10.695-.381-.045-.765-1.76-.765-2.405z" />
      </svg>
    ),
  },
];

const features = [
  "إضافة، تعديل، وحذف المنح بسهولة.",
  "امكانية البحث والتصفية.",
  "عرض واضح للمنح وتفاصيلها.",
  "توضيح التواريخ النهائية والايام المتبقية.",
  "احصائيات شاملة ودقيقة للمنح.",
  "اشكال بيانية لعرض اوضح للبياانات.",
];

const comingFeats = [
  "اضافة نظام اشعارات ذكية.",
  "دعم للغة الانجليزية بجانب العربية.",
  "تقويم تفاعلي للمنح وتواريخها.",
];

const futureFeats = [
  "امكانية رفع وتخزين المستندات",
  "توفير منح للتصفح والاختيار.",
  "اقتراح منح مناسبة للمستخدم",
];

const advantages = [
  {
    icon: <ShieldCheck />,
    title: "حماية البيانات",
    text: "نحرص على حماية بيانات المستخدمين من خلال تشفير متقدم وسياسة خصوصية واضحة.",
    color: "var(--primary)",
    bgColor: "var(--primary-50)",
  },
  {
    icon: <Zap />,
    title: "أداء عالي",
    text: "سرعة فائقة في التحميل واستجابة فورية للإجراءات، مع تحسين لمحركات البحث لوصول أوسع.",
    color: "var(--success)",
    bgColor: "var(--success-bg)",
  },
  {
    icon: <MousePointerClick />,
    title: "سهولة وتفعالية",
    text: "واجهات بديهية وبسيطة تتيح للمستخدمين تحقيق أهدافهم بكفاءة عالية واقل جهد ممكن.",
    color: "var(--warning)",
    bgColor: "var(--warning-bg)",
  },
  {
    icon: <CodeXml />,
    title: "قابلية التطوير",
    text: "بنية مرنة مصممة خصيصا لتكون قابلة للتوسع مع تحديثات مستمرة دون تعطيل الخدمة.",
    color: "var(--info)",
    bgColor: "var(--info-bg)",
  },
];
export default function About() {
  return (
    <div className="about page">
      <h2>عن المنصة</h2>
      <div className="container">
        <div className="c1 card">
          <div>
            <h3>ما هو ScholarMate</h3>
            <p>
              ScholarMate هو منصة إلكترونية لإدارة وتتبع المنح الدراسية والفرص
              التعليمية والبحثية. بتيح للمستخدمين إضافة منح جديدة، تعديلها،
              تصفحها، والاطلاع على أقرب المواعيد النهائية للتقديم. الهدف منه ان
              يكون مكتبة منظمة وحديثة باستمرار لكل الفرص المتاحة في مكان واحد.
            </p>
          </div>
          <div>
            <h3>من وراء ScholarMate</h3>
            <p>
              أنا موهيّد معاوية، مطوّر ويب مهتم ببناء حلول عملية للمشاكل اليومية
              وتخدم المجتمع. عندي خبرة في تطوير الواجهات الأمامية والخلفية،
              واقوم باستكشاف تقنيات جديدة دوما.
            </p>
          </div>
          <div>
            <h3>لماذا انشأت ScholarMate</h3>
            <p>
              لطالما كنت مهتما بالبحث والتقديم على مختلف المنح الدراسية، وقد
              لاحظت صعوبة في تذكر كل المنح التي قدمت عليها وتواريخها وتفاصيلها.
              حتى انني افوت فرصة التقديم على منحة بسبب عدم الانتباه الى موعدها.
              ولهذا ومن واقع تجربتي الشخصية بنيت ScholarMate ليكون يد العون التي
              لطالما احتجتها
            </p>
          </div>
        </div>
        <div className="c2">
          <h3>التقنيات المستخدمة</h3>
          <div className="techs">
            {technologies.map((tech, i) => (
              <div
                className={
                  tech.description == "Animations" ? "fill card" : "card"
                }
                key={i}
              >
                <div className="text">
                  <h4>{tech.label}</h4>
                  <p>{tech.description}</p>
                </div>
                <span className="icon">{tech.icon}</span>
              </div>
            ))}
          </div>
        </div>
        <div className="c3 card">
          <h3>المميزات الحالية</h3>
          <ul>
            {features.map((feat, i) => (
              <li key={i}>{feat}</li>
            ))}
          </ul>
        </div>

        <div className="c4 card">
          <h3>المميرات المستقبلية</h3>
          <ul>
            {comingFeats.map((feat, i) => (
              <li key={i}>{feat}</li>
            ))}
          </ul>
        </div>

        <div className="c5 card">
          <h3>المميرات المستقبلية</h3>
          <ul>
            {futureFeats.map((feat, i) => (
              <li key={i}>{feat}</li>
            ))}
          </ul>
        </div>

        <div className="c6">
          {advantages.map((adv, i) => (
            <div className="card" key={i}>
              <div>
                <span
                  className="icon"
                  style={{ color: adv.color, backgroundColor: adv.bgColor }}
                >
                  {adv.icon}
                </span>
                <h3>{adv.title}</h3>
              </div>
              <p>{adv.text}</p>
            </div>
          ))}
        </div>

        <div className="c7 card">
          <div className="text">
            <h3>كن شريكا في ScholarMate</h3>
            <p>نرحب بكل من يرغب بالمساهمة، سواءً عبر:</p>
            <div className="item">
              <Laptop />
              <span>خبرات تقنية.</span>
            </div>
            <div className="item">
              <Lightbulb />
              <span>أفكار واستشارات.</span>
            </div>
            <div className="item">
              <HeartHandshake />
              <span>دعم مالي أو موارد.</span>
            </div>

            <div className="btns">
              <motion.a
                href="mailto:moayyad2.0@gmail.com"
                target="blank"
                className="primary"
                initial="rest"
                whileHover="hover"
                whileTap="tap"
                variants={hoverEffect}
              >
                <Mail /> تواصل معي
              </motion.a>
              <motion.a
                href="https://github.com/Mohayyad-Muawia/scholarMate"
                target="blank"
                className="primary github"
                initial="rest"
                whileHover="hover"
                whileTap="tap"
                variants={hoverEffect}
              >
                <Github /> زيارة Github
              </motion.a>
            </div>
          </div>

          <img src="images/deal.svg" alt="deal" />
        </div>
      </div>
    </div>
  );
}
